Revit 2026 API

# TagOrientationBehavior Enumeration

---

This attribute describes the family orientation behavior.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TagOrientationBehavior
```
```vb
Public Enumeration TagOrientationBehavior
```
```cpp
public enum class TagOrientationBehavior
```
```fsharp
type TagOrientationBehavior
```

| Member name | Value | Description |
| --- | --- | --- |
| Fixed | 0 |  |
| RotateAndStayUpright | 2 |  |
| RotateWithHost | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace